sosukigara/2025_NIGINIGI_ESP32_OTA/src/main.cpp
  servo1.setPeriodHertz(50);
  servo2.setPeriodHertz(50);
  servo3.setPeriodHertz(50);

  attachAllServos();
  setAllServosAngle(270);

  // --- AP Mode Setup (Yakisoba-Shiro) ---
  WiFi.disconnect(true);
  delay(100);
  WiFi.mode(WIFI_AP);
  WiFi.softAP("焼きそば四郎"); // No Password

  Serial.print("AP IPs: ");
  Serial.println(WiFi.softAPIP());

  // DNS Server (Captive Portal)
  dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
  dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());

  server.on("/", handleRoot);
  server.on("/api/status", handleApiStatus);
  server.on("/api/start", handleApiStart);
  server.on("/api/stop", handleApiStop);
  server.on("/api/settings", handleApiSettings);
  server.on("/api/pin13", handleApiPin13);
  server.on("/api/manual", handleApiManual);
  server.on("/api/manual_angle", handleApiManualAngle);
  server.on("/api/servo_all", handleApiServoAll);
  server.on("/api/servo_individual", handleApiServoIndividual);
  server.on("/api/history", handleApiHistory);

  // Captive Portal Redirect
  server.onNotFound([]() { handleRoot(); });

  server.begin();
  Serial.println("Ready.");
}

void loop() {
  dnsServer.processNextRequest();
  server.handleClient();

  unsigned long now = millis();

  if (currentState != lastState) {
    stateStartTime = now;
    Serial.printf("State: %d\n", currentState);

    if (currentState == PREPARE_SQUEEZE) {
      attachAllServos();
      setAllServosAngle(270);
    }
    lastState = currentState;
  }

  switch (currentState) {
  case IDLE:
    // Auto Detach Removed as per user request
    break;

  case PREPARE_SQUEEZE:
    setAllServosAngle(270);
    if (now - stateStartTime > 300) {
      currentState = SQUEEZING;
    }
    break;

  case SQUEEZING: {
    unsigned long duration = reachTimeSec * 1000;
    unsigned long elapsed = now - stateStartTime;
    int startUs = US_AT_270_DEG;
    int targetUs = strengthToUs(targetStrength);

    if (elapsed >= duration) {
      setAllServosUs(targetUs);
      currentState = HOLDING;
    } else {
      float progress = (float)elapsed / (float)duration;
      int currentUs = startUs + (targetUs - startUs) * progress;
      setAllServosUs(currentUs);
    }
  } break;

  case HOLDING:
    if (now - stateStartTime >= (holdTimeSec * 1000)) {
      currentState = RELEASING;
    }
    break;

  case RELEASING:
    setAllServosAngle(270);
    if (now - stateStartTime >= 300) {
      currentState = WAIT_CYCLE;
    }
    break;

  case WAIT_CYCLE:
    currentCycle++;
    if (currentCycle < targetCount) {
      currentState = SQUEEZING;
    } else {
      Serial.println("Finished.");
      setAllServosAngle(270);
      currentState = IDLE;

      // --- 履歴保存 ---
      struct tm timeinfo;
      if (!getLocalTime(&timeinfo)) {
        Serial.println("Failed to obtain time");
      } else {
        char timeStringBuff[50];
        strftime(timeStringBuff, sizeof(timeStringBuff), "%Y/%m/%d %H:%M",
                 &timeinfo);

        HistoryItem newItem;
        newItem.timeStr = String(timeStringBuff);
        newItem.preset = currentSessionPreset;
        newItem.strength = targetStrength;
        newItem.count = targetCount;

        historyLog.push_back(newItem);

        // 最大保存件数 (20件)
        if (historyLog.size() > 20) {
          historyLog.erase(historyLog.begin());
        }
      }
      // ----------------
    }
    break;
  }
}
